// Identify attempts to delete data on multiple drives using cipher.exe
// This is commonly performed by ransomware to prevent data recovery after encryption
DeviceProcessEvents
| where Timestamp > ago(1d)
| where FileName =~ "cipher.exe" 
| where ProcessCommandLine has "/w" 
| summarize CipherCount = dcount(ProcessCommandLine),
CipherList = make_set(ProcessCommandLine) by DeviceId, bin(Timestamp, 1m) 
| where CipherCount > 1 // Checks if cipher.exe has access more than 1 drive in a short timeframe
