// Identify instances of bitlocker modifying registry settings to allow encryption, where it's executed via a .bat file
DeviceProcessEvents
| where FileName =~ "reg.exe" 
    and ProcessCommandLine has "EnableBDEWithNoTPM"
    // Using contains due to variant forms of capturing 1: 1, 0x1
    and (ProcessCommandLine has "true" or ProcessCommandLine contains "1")
| where InitiatingProcessCommandLine has_all (@"C:\Windows\", ".bat")
